package  com.ixiyou.formatters
{
	/**
	 * 中国日期信息. 
	 * @author Sean
	 * 
	 */	
	public class ChinaDateInfo extends DateInfo
	{
		/**
		 * 构造函数
		 * @return 
		 * 
		 */		
		public function ChinaDateInfo()
		{
			super();
			/**
			* 长的星期名称.
			*/		
			dayNamesLong = ["星期日","星期一", "星期二", "星期三", "星期四","星期五","星期六"];
			
			/**
			* 短的星期名称.
			*/		
			dayNamesShort = ["日", "一", "二", "三", "四", "五", "六"];
			
			/**
			* 长的月份名称.
			*/		
			monthNamesLong =  ["一月","二月","三月","四月","五月","六月","七月","八月","九月","十月","十一月","十二月"];
			
			/**
			* 短的月份名称.
			*/		
			monthNamesShort =  ["一","二","三","四","五","六","七","八","九","十","十一","十二"];
			
			/**
			* 一天中的时间表示.
			*/		
			timeOfDay = ["上午", "下午"];
			
			/**
			* 日期名称.
			*/
			todayNames = ["零","初一","初二","初三","初四","初五","初六","初七","初八","初九","初十","十一","十二","十三","十四","十五","十六","十七","十八","十九","廿十","廿一","廿二","廿三","廿四","廿五","廿六","廿七","廿八","廿九","卅十","卅一"];
			
			/**
			* 时间格式.
			*/		
			time = "H:mm:ss";
			
			/**
			* 长日期格式.
			*/		
			dateLong = "YYYY年MM月dd日";
			
			/**
			* 短日期格式.
			*/		
			dateShort = "YYYY-M-d";
		}
		
	}
}